lirush/pss_stm32/periph/inc/sensors.h
#ifndef SENSORS_H
#define SENSORS_H

#define InA1   	    0
#define InB1		1
#define InA2 		2
#define InB2  	    3
#define InA3	 	4
#define InB3 	 	5
#define InA4 		6
#define InB4 		7
#define InA5 		0
#define InB5 		1
#define InA6 		2
#define InB6 		3
#define InA7 		4
#define InB7 		5
#define InA8 		6
#define InB8 		7
#define InA9 		0
#define InB9 		1
#define InA10 		2
#define InB10 		3
#define InA11 		4
#define InB11 		5
#define InA12 		6
#define InB12 		7
#define InA13 		0
#define InB13 		1
#define InA14 		2
#define InB14 		3
#define InA15 		4
#define InB15 		5
#define InA16 		6
#define InB16 		7
#define InA17 		0
#define InB17 		1
#define InA18 		2
#define InB18 		3
#define InA19 		4
#define InB19 		5
#define InA20 		6
#define InB20		7


void Read_from_sensor(void);

#endif //SENSORS_H
